# Name2Index

## Description
Function Name2Index returns the internal index number for the specified object.

```pascal
FUNCTION Name2Index(name : STRING) : LONGINT;
```

```python

def vs.Name2Index(name):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|Name of object.|

## Remarks
Returns the internal index for the object associated with the specified name.

## See Also
VS Functions:
SetSkylight| CreateSkylight| AddCavity

## Version
Availability: from VectorWorks8.0
## Category
* Object Names